# StructuralSectionIshapeFlangethicknessLocation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionIshapeFlangethicknessLocation Property
ParameterTypeId Class See Also
---
"Flange Thickness Location"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionIshapeFlangethicknessLocation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionIshapeFlangethicknessLocation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionIshapeFlangethicknessLocation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace